NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32FG23/EFR32FG23A011F512GM40.svd
        <register>
          <name>VITERBIDEMOD</name>
          <description>No Description</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00206100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VTDEMODEN</name>
              <description>Viterbi demodulator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HARDDECISION</name>
              <description>Hard decision</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VITERBIKSI1</name>
              <description>VITERBI KSI1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VITERBIKSI2</name>
              <description>VITERBI KSI2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VITERBIKSI3</name>
              <description>VITERBI KSI3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNTHAFC</name>
              <description>Synthesizer AFC in Viterbi demod</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRCYCLE</name>
              <description>Correction cycles</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRSTPSIZE</name>
              <description>Correction step size</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTCORRCFG0</name>
          <description>No Description</description>
          <addressOffset>0x144</addressOffset>
          <access>read-write</access>
          <resetValue>0x123556B7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXPECTPATT</name>
              <description>Expected pattern</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTCORRCFG1</name>
          <description>No Description</description>
          <addressOffset>0x148</addressOffset>
          <access>read-write</access>
          <resetValue>0x5020C000</resetValue>
          <resetMask>0xF7FDFFFF</resetMask>
          <fields>
            <field>
              <name>VITERBIKSI3WB</name>
              <description>WB KSI3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KSI3SWENABLE</name>
              <description>WB KSI3 Switching Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VTFRQLIM</name>
              <description>Viterbi frequency limiter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXPSYNCLEN</name>
              <description>Expected sync length</description>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXPECTHT</name>
              <description>Expected patterns head and tail</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTTRACK</name>
          <description>No Description</description>
          <addressOffset>0x14C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0D803B88</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FREQTRACKMODE</name>
              <description>Frequency tracking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Frequency tracking disabled. Only a one-time frequency offset compensation applied through DSA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Frequency tracking enabled with one correction, when needed, every 16 symbol periods.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Frequency tracking enabled with one correction, when needed, every 32 symbol periods.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Frequency tracking enabled with one correction, when needed, every 48 symbol periods.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMTRACKTHD</name>
              <description>Timing tracking threshold</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEACQUTHD</name>
              <description>Time acquisition threshold</description>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMGEAR</name>
              <description>Timing Gear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GEAR0</name>
                  <description>Execute timing tracking regardless of difference between Early/Late and Current correlation values. Referred to as fast gear. Same as GEAR3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GEAR1</name>
                  <description>Execute timing tracking only when correlation value of Early/Late is 75% or less of the Current correlation value. Referred to as medium gear.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GEAR2</name>
                  <description>Execute timing tracking only when correlation value of Early/Late is 50% or less of the Current correlation value. Referred to as slow gear.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQBIAS</name>
              <description>Frequency estimation bias</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIPWRTHD</name>
              <description>High Power detection threshold</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTBLETIMING</name>
          <description>No Description</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x8000FFF3</resetMask>
          <fields>
            <field>
              <name>VTBLETIMINGSEL</name>
              <description>Viterbi BLE timing stamp selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAMEDET_DELAY</name>
                  <description>Delayed frame detection will be used as Timing stamp. This mode should be selected for legacy demod and Long Range BLE demod. </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END_FRAME_PULSE</name>
                  <description>The end of frame detection from Narrow Viterbi demod will be used as Timing stamp. This signal is a narrow pulse signal and pulse width is one xo clock cycle. </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END_FRAME</name>
                  <description>The end of frame detection from Narrow Viterbi demod will be used as Timing stamp. This signal is a wdie pulse signal </description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_END_FRAME</name>
                  <description>For testing only.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMINGDELAY</name>
              <description>Viterbi BLE Delay timer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLENOFF</name>
              <description>Timing Stamp Frame Length Offset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISDEMODOF</name>
              <description>Disable VT Demod Over Flow Detection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BREST</name>
          <description>No Description</description>
          <addressOffset>0x154</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>BRESTINT</name>
              <description>Integer part of estimated baudrate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BRESTNUM</name>
              <description>Fractional part of estimated baudrate</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCG</name>
          <description>No Description</description>
          <addressOffset>0x158</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>AUTOCGEN</name>
              <description>Enable automatic clock gating</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CGCLKSTOP</name>
          <description>No Description</description>
          <addressOffset>0x15C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>FORCEOFF</name>
              <description>Manual control clocks</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POE</name>
          <description>No Description</description>
          <addressOffset>0x160</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF03FF</resetMask>
          <fields>
            <field>
              <name>POEI</name>
              <description>In-phase component of POE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POEQ</name>
              <description>Quadrature component of POE.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIRECTMODE</name>
          <description>No Description</description>
          <addressOffset>0x164</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000010C</resetValue>
          <resetMask>0x00001F0F</resetMask>
          <fields>
            <field>
              <name>DMENABLE</name>
              <description>Enable Direct Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCASYNC</name>
              <description>Choose Synchronous or Asynchronous mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCPREAM</name>
              <description>Synchronous mode preamble</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADD0</name>
                  <description>No preamble bits appended</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD8</name>
                  <description>8 preamble bits appended</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD16</name>
                  <description>16 preamble bits appended</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD32</name>
                  <description>32 preamble bits appended</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKWIDTH</name>
              <description>Synchronous mode clock pulse width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE1</name>
          <description>No Description</description>
          <addressOffset>0x16C</addressOffset>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFF7FFF</resetMask>
          <fields>
            <field>
              <name>LRSS</name>
              <description>Long Range Signal Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRTIMEOUTTHD</name>
              <description>Long Range Time Out Threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPWRACCUDEL</name>
              <description>Channel Power Accumulated Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEL0</name>
                  <description>Use accumulated channel power value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEL32</name>
                  <description>Delayed by 32 chips</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEL64</name>
                  <description>Delayed by 64 chips</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSVAL</name>
              <description>Hysteresis Value for BBSS</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVGWIN</name>
              <description>Average window</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRSPIKETHADD</name>
              <description>Long Range DSA spike threshold addition</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOGICBASEDPUGATE</name>
              <description>Logic Based Phase Unwrap Gating</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOGICBASEDLRDEMODGATE</name>
              <description>Logic Based Long Range Demod Gating</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFILTLEN</name>
              <description>Prefilter Length</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEN32</name>
                  <description>Filter length is 32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN64</name>
                  <description>Filter length is 64</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN96</name>
                  <description>Filter length is 96</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN128</name>
                  <description>Filter length is 128</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE2</name>
          <description>No Description</description>
          <addressOffset>0x170</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRTH1</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH2</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH3</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH4</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE3</name>
          <description>No Description</description>
          <addressOffset>0x174</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRTH5</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH6</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH7</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH8</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
